///////////////////////////////////////////////////////////////////////
//    随机抽样库                                                      //
//    此库的目标为完成计算物理中所有的随机数相关的内容，包括生成随机数、    //
//    各种抽样算法以及日后可能出现的算法。                               //
//    作者：Jerry_Shen                                                //
//    日期：2019/9/17                                                 //
///////////////////////////////////////////////////////////////////////


#include"RandomNumberJS.h"
#include"SamplingJS.h"